ArronOC/Portfolio/PetriDish_BareMetal/drivers/Src/stm32f101xx_i2c_driver.c
/*
 * stm32f101xx_i2c_driver.c
 *
 *  Created on: Dec 8, 2024
 *      Author: arron
 */


#include "stm32f101xx_i2c_driver.h"
#include "main.h"

/* =========Private functions========= */
static void I2C_GenerateSTARTCondition(I2C_RegDef_t *pI2Cx);
static void I2C_ExecuteAddressPhase(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr, uint8_t READorWRITE);
static void I2C_ClearADDRFlag(I2C_RegDef_t *pI2Cx);

/*****************************************************************
 * @fn			- I2C_GenerateSTARTCondition
 *
 * @brief		- This function generates a I2C START condition on the given I2C peripheral
 *
 * @param[in]	- I2C peripheral to generate START condition on
 *
 * @return		- none
 *
 * @Note		-
 */
static void I2C_GenerateSTARTCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_START);
}

/*****************************************************************
 * @fn			- I2C_GenerateSTOPCondition
 *
 * @brief		- This function generates a I2C STOP condition on the given I2C peripheral
 *
 * @param[in]	- I2C peripheral to generate STOP condition on
 *
 * @return		- none
 *
 * @Note		-
 */
void I2C_GenerateSTOPCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_STOP);
}

/*****************************************************************
 * @fn			- I2C_ExecuteAddressPhase
 *
 * @brief		- This function executes the address phase on the given I2C peripheral
 *
 * @param[in]	- I2C peripheral to generate address phase on
 * @param[in]	- Address of slave device
 * @param[in]	- Write or Read operation
 *
 * @return		- none
 *
 * @Note		-
 */
static void I2C_ExecuteAddressPhase(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr, uint8_t READorWRITE)
{
	SlaveAddr = SlaveAddr << 1;

	if (READorWRITE == READ)
	{
		SlaveAddr |= 1;			// Slave address + the R bit
	} else
	{
		SlaveAddr &= ~(1);		// Slave address + the W bit
	}

	pI2Cx->DR = SlaveAddr;
}

/*****************************************************************
 * @fn			- I2C_ClearADDRFlag
 *
 * @brief		- This function clears the ADDR flag in the status register for the given I2C peripheral
 *
 * @param[in]	- I2C peripheral to clear ADDR flag on
 *
 * @return		- none
 *
 * @Note		-
 */
static void I2C_ClearADDRFlag(I2C_RegDef_t *pI2Cx)
{
	uint32_t dummyRead;
	dummyRead = pI2Cx->SR[0];
	dummyRead = pI2Cx->SR[1];

	// Noticed that it sometimes isn't cleared on the first attempt, so read it again
	if ( I2C_GetFlagStatus(pI2Cx, I2C_FLAG_ADDR) )
	{
		dummyRead = pI2Cx->SR[0];
		dummyRead = pI2Cx->SR[1];
	}

	(void) dummyRead;	// Suppress compiler warning message
}

/* ================================ */

/*****************************************************************
 * @fn			- I2C_PeriClockControl
 *
 * @brief		- This function enables or disables peripheral clock for the given I2C peripheral
 *
 * @param[in]	- base address of the I2C peripheral
 * @param[in]	- ENABLE or DISABLE macros
 *
 * @return		- none
 *
 * @Note		- none
 */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		if (pI2Cx == I2C1)
		{
			I2C1_PCLK_EN();
		}else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_EN();
		}
	} else
	{
		if (pI2Cx == I2C1)
		{
			I2C1_PCLK_DI();
		}else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_DI();
		}
	}
}

/*****************************************************************
 * @fn			- I2C_EnorDI
 *
 * @brief		- This function enables or disables the given I2C peripheral
 *
 * @pI2Cx		- base address of the I2C peripheral
 * @EnorDI		- ENABLE or DISABLE macros
 *
 * @return		- none
 *
 * @Note		- none
 */
void I2C_EnorDI(I2C_RegDef_t *pI2Cx, uint8_t EnorDI)
{
	if (EnorDI)
	{
		pI2Cx->CR1 |= (0x1 << I2C_CR1_PE);	/* Enables the I2C peripheral (PE) */
	} else
	{
		/*
		 * Don't need to wait for communication to end as it will disable
		 * the peripheral automatically at the end of communication
		 */
		pI2Cx->CR1 &= ~(0x1 << I2C_CR1_PE);	/* Disable the I2C peripheral (PE) */
	}

}


/*****************************************************************
 * @fn			- I2C_Init
 *
 * @brief		- This function configures the I2C peripheral
 *
 * @pI2CxHandle	- handle of the I2C peripheral
 *
 * @return		- none
 *
 * @Note		- none
 */
void I2C_Init(I2C_Handle_t *pI2CxHandle)
{
	uint32_t CCR = 0;
	uint8_t trise;

	// Enable the I2C clock source
	I2C_PeriClockControl(pI2CxHandle->pI2Cx, ENABLE);

	// Disable the I2C Peripheral so that all registers can be altered
	I2C_EnorDI(pI2CxHandle->pI2Cx, DISABLE);

	// Calculate value of PCLK1
	uint32_t PCLK1 = RCC_GetPCLK1_Value();

	// 1.Configure the mode to fast or standard
	if (pI2CxHandle->I2C_Config.I2C_SCLSpeed > I2C_SCL_SPEED_SM1K)	// Check if configuring for standard or fast mode
	{
		//Configure the mode to fast
		pI2CxHandle->pI2Cx->CCR |= (0x1 << I2C_CCR_FS);

		// Set the duty cycle (not needed in standard mode)
		if (pI2CxHandle->I2C_Config.I2C_DutyCycle == I2C_FM_DUTY_2)
		{
			pI2CxHandle->pI2Cx->CCR &= ~(0x1 << I2C_CCR_DUTY);	// Duty cycle = /2

			/*
			 * Th = CCR*Tpclk1
			 * Tl = 2*CCR*Tpclk1
			 * Th + Tl = 3*CCR*Tpclk1
			 * Th + Tl = 3*CCR/APB1freq
			 * CCR = (Th+Tl)APB1freq/3
			 * CCR = APB1freq/(3*SCLfreq)
			 */
			CCR = PCLK1 / (3 * pI2CxHandle->I2C_Config.I2C_SCLSpeed);
		} else
		{
			pI2CxHandle->pI2Cx->CCR |= (0x1 << I2C_CCR_DUTY);	// Duty cycle = 16/9

			/*
			 * Th = 9*CCR*Tpclk1
			 * Tl = 16*CCR*Tpclk1
			 * Th + Tl = 25*CCR*Tpclk1
			 * (1/SCLfreq) = 25*CCR/APB1freq
			 * SCLfreq = APB1freq/25*CCR
			 * CCR = APB1freq/(25*SCLfreq)
			 */
			CCR = PCLK1 / (25 * pI2CxHandle->I2C_Config.I2C_SCLSpeed);
		}
	} else
	{
		//Configure the mode to standard
		pI2CxHandle->pI2Cx->CCR &= ~(0x1 << I2C_CCR_FS);

		// CCR = APB1freq/(2*SCLfreq)
		CCR = PCLK1 / (2 * pI2CxHandle->I2C_Config.I2C_SCLSpeed);

	}
	// Configure the Clock Control register CCR value from previously calculated value
	CCR &= 0xFFF; // ensure only 12 bits are used
	pI2CxHandle->pI2Cx->CCR |= (CCR << I2C_CCR_CCR);


	// 2.Configure the speed of SCL
	pI2CxHandle->pI2Cx->CR2 &= ~(0x3F << I2C_CR2_FREQ);			 	// Reset CR2 FREQ[5:0]
	pI2CxHandle->pI2Cx->CR2 |= ((PCLK1 / 1000000U) & 0x3F) << I2C_CR2_FREQ;	// Set CR2 FREQ[5:0]

	//3.Configure device address (only used when slave)
	pI2CxHandle->pI2Cx->OAR[0] &= ~(0x3FF << I2C_OAR1_ADDR10BIT);	// Reset Own Address 1

	if (pI2CxHandle->I2C_Config.I2C_AddrMode == I2C_10BIT_SLAVE)
	{
		pI2CxHandle->pI2Cx->OAR[0] |= (0x1 << I2C_OAR1_ADDMODE); 									// Set to 10 bit address mode
		pI2CxHandle->pI2Cx->OAR[0] |= (pI2CxHandle->I2C_Config.I2C_OwnAddr1 << I2C_OAR1_ADDR10BIT);	// Set the 10 bit address
	} else
	{
		pI2CxHandle->pI2Cx->OAR[0] &= ~(0x1 << I2C_OAR1_ADDMODE); 									// Set to 7 bit address mode
		pI2CxHandle->pI2Cx->OAR[0] |= (pI2CxHandle->I2C_Config.I2C_OwnAddr1 << I2C_OAR1_ADDR7BIT);	// Set the 7 bit address

		// Configure the second device address
		if (pI2CxHandle->I2C_Config.I2C_DualAddrEn == I2C_DUAL_ADDRESS_EN)
		{
			pI2CxHandle->pI2Cx->OAR[1] |= (0x1 << I2C_OAR2_ENDUAL);		// enable dual 7 bit addressing
			pI2CxHandle->pI2Cx->OAR[1] &= ~(0x7F << I2C_OAR2_ADDR2);	// Reset Own Address 2
			pI2CxHandle->pI2Cx->OAR[1] |= (pI2CxHandle->I2C_Config.I2C_OwnAddr2 << I2C_OAR2_ADDR2); // Set the second 7 bit address
		} else
		{
			pI2CxHandle->pI2Cx->OAR[1] &= ~(0x1 << I2C_OAR2_ENDUAL);	// disable dual 7 bit addressing
		}
	}

	//4.Configure the rise time for I2C pins
	/*
	 * TRISE = (Fpclk1 * Trise(max)) + 1
	 * TRISE = FPCLK1 *
	 * Sm Trise(max) = 1000ns
	 * Fm Trise(max) = 300ns
	 */

	if (pI2CxHandle->I2C_Config.I2C_SCLSpeed > I2C_SCL_SPEED_SM1K)	// Check if configuring for standard or fast mode
	{
		// Fast mode
		trise = ((PCLK1 * 30U) / 100000000U) + 1;
	} else
	{
		// Standard mode
		trise = (PCLK1 / 1000000U) + 1;
	}
	pI2CxHandle->pI2Cx->TRISE = (trise & 0x3F);	// only 5 bits


	//5. Enable the peripheral
	I2C_EnorDI(pI2CxHandle->pI2Cx, ENABLE);

	//6. Configure the Acking mode (can only be done once peripheral enabled)
	if (pI2CxHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLED)
	{
		pI2CxHandle->pI2Cx->CR1 |= (0x1 << I2C_CR1_ACK);	// Enable Ack
	} else
	{
		pI2CxHandle->pI2Cx->CR1 &= ~(0x1 << I2C_CR1_ACK);	// Disable Ack
	}

	//6. Enable Error interrupts
	pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
}

/*****************************************************************
 * @fn			- I2C_DeInit
 *
 * @brief		- This function resets the I2C peripheral
 *
 * @pI2Cx		- base address of the I2C peripheral
 *
 * @return		- none
 *
 * @Note		- none
 */
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
	if (pI2Cx == I2C1)
	{
		I2C1_RST();
	} else
	{
		I2C2_RST();
	}
}

/*****************************************************************
 * @fn			- RCC_GetPCLK1_Value
 *
 * @brief		- This function calculates the APB1 clock frequency in Hz
 * 				  Which is used for configuring the I2C peripheral
 *
 *
 * @return		- APB1/PCLK1 clock frequency in Hz
 *
 * @Note		- none
 */
uint32_t RCC_GetPCLK1_Value(void)
{
	uint32_t pclk1, sysclk, hclk, clksrc, pllsrc, prediv1, pllmul,
	ahbpre, apb1pre;

