ArronOC/Portfolio/PetriDish_BareMetal/drivers/Src/stm32f101xx_i2c_driver.c
	uint32_t AHB_PreScaler[8] = {2,4,8,16,64,128,256,512};
	uint32_t APB1_PreScaler[4] = {2,4,8,16};

	//1. Determine SYSCLK source
	clksrc = (RCC->CFGR & RCC_CFGR_SWS_MASK) >> RCC_CFGR_SWS;

	if (clksrc == 0) 	// HSI used as system clock
	{
		sysclk = HSI_CLK_FREQ; //8 MHz
	} else if (clksrc == 1) // HSE used as system clock
	{
		sysclk = HSE_OSC_FREQ; //defined in main.h
	} else	//PLL used as system clock
	{
		//Determine PLL source
		pllsrc = (RCC->CFGR >> RCC_CFGR_PLLSRC) & 0x1;
		if (pllsrc == 0) //HSI/2 used as PLL clock
		{
			sysclk = HSI_CLK_FREQ / 2;
		} else	// Clock from PREDIV1 selected as PLL clock
		{
			// this is HSE divided by either 1 or 2
			prediv1 = (RCC->CFGR >> RCC_CFGR_PLLXTPRE) & 0x1;
			if (prediv1 == 0)
			{
				// PREDIV1 does not divide HSE clock
				sysclk = HSE_OSC_FREQ;
			} else
			{
				// PREDIV1 divides HSE clock by 2
				sysclk = HSE_OSC_FREQ / 2;
			}

			// Take PLLMUL into account
			pllmul = (RCC->CFGR & RCC_CFGR_PLLMUL_MASK) >> RCC_CFGR_PLLMUL;
			if (pllmul == 2)
			{
				sysclk = sysclk * 4;	//PLL input clock x4
			} else if (pllmul == 3)
			{
				sysclk = sysclk * 5;	//PLL input clock x5
			} else if (pllmul == 4)
			{
				sysclk = sysclk * 6;	//PLL input clock x6
			} else if (pllmul == 5)
			{
				sysclk = sysclk * 7;	//PLL input clock x7
			} else if (pllmul == 6)
			{
				sysclk = sysclk * 8;	//PLL input clock x8
			} else if (pllmul == 7)
			{
				sysclk = sysclk * 9;	//PLL input clock x9
			} else if (pllmul == 13)
			{
				sysclk = (sysclk * 6) + (sysclk / 2);	//PLL input clock x6.5
			}
		}
	}

	//2. Take AHB Prescaler into account
	ahbpre = (RCC->CFGR & RCC_CFGR_HPRE_MASK) >> RCC_CFGR_HPRE;
	if (ahbpre < 8)
	{
		hclk = sysclk;
	} else
	{
		hclk = sysclk / AHB_PreScaler[ahbpre - 8];
	}

	//3. Take APB1 Prescaler into account
	apb1pre = (RCC->CFGR & RCC_CFGR_PPRE1_MASK) >> RCC_CFGR_PPRE1;
	if (apb1pre < 4)
	{
		pclk1 = hclk;
	} else
	{
		pclk1 = hclk / APB1_PreScaler[apb1pre - 4];
	}

	return pclk1;
}

/*****************************************************************
 * @fn			- I2C_MasterSendData
 *
 * @brief		- This function sends data to a slave device
 *
 * @param[in]	- pointer to the Handle of the I2C peripheral
 * @param[in]	- pointer to the data to transmit
 * @param[in]	- number of bytes to transmit
 * @param[in]	- address of the slave device
 * @param[in]	- maximum time to wait for the I2C operation in milliseconds
 *
 * @return		- I2C error code
 *
 * @Note		-
 */
I2C_ERROR_CODE  I2C_MasterSendData(I2C_Handle_t *pI2CxHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr, uint32_t TIMEOUT_MS)
{
	uint32_t TIMEDOUT = 0;
	SYST_STARTorSTOP(ENABLE);

	//1. Generate the START condition
	I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);

	//2. Confirm that start generation is completed by checking the SB flag in the SR1
	//	 Note: Until SB is cleared SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_SB)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//3. Send the address of the slave with R/W bit set to w(0) (total 8 bits)
	I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, SlaveAddr, WRITE);

	//4. Confirm that address phase is completed by checking the ADDR flag in SR1 register
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_ADDR)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//5. Clear the ADDR flag according to its software sequence
	//	 Note: Until ADDR is cleared SCL will be stretched (pulled low)
	I2C_ClearADDRFlag(pI2CxHandle->pI2Cx);

	//6. Send the data until Len becomes 0
	while (Len > 0)
	{
		while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_TXE)) && (!TIMEDOUT) )	// wait until TXE is set
		{
			TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
		}
		if ( TIMEDOUT )	return USER_TIMEOUT;

		pI2CxHandle->pI2Cx->DR = *pTxBuffer;
		pTxBuffer++;
		Len--;
	}

	//7. When Len becomes zero wait for TXE=1 & BTF=1 before generating the STOP condition
	//	 Note: TXE=1, BTF=1, means that both SR and DR are empty and next transmission should begin
	//		  when BTF=1 SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_TXE)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_BTF)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//8. Generate STOP condition and master need not to wait for the completion of STOP condition.
	//   Note: generating STOP, automatically clears the BTF
	I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);

	return I2C_NO_ERROR;
}


/*****************************************************************
 * @fn			- I2C_MasterReceiveData
 *
 * @brief		- This function reads data from a slave device
 *
 * @param[in]	- pointer to the Handle of the I2C peripheral
 * @param[in]	- pointer to store the read data too
 * @param[in]	- number of bytes to read
 * @param[in]	- address of the slave device
 * @param[in]	- maximum time to wait for the I2C operation in milliseconds
 *
 * @return		- I2C error code
 *
 * @Note		-
 */
I2C_ERROR_CODE I2C_MasterReceiveData(I2C_Handle_t *pI2CxHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr, uint32_t TIMEOUT_MS)
{
	uint32_t TIMEDOUT = 0;
	SYST_STARTorSTOP(ENABLE);

	//1. Generate the START condition
	I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);

	//2. Confirm that start generation is completed by checking the SB flag in the SR1
	//	 Note: Until SB is cleared SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_SB)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//3. Send the address of the slave with R/W bit set to r(1) (total 8 bits)
	I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, SlaveAddr, READ);

	//4. Confirm that address phase is completed by checking the ADDR flag in SR1 register
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_ADDR)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//5. Clear the ADDR flag according to its software sequence
	I2C_ClearADDRFlag(pI2CxHandle->pI2Cx);

