ArronOC/Portfolio/PetriDish_BareMetal/drivers/Src/stm32f101xx_i2c_driver.c
	//6. For single byte reception disable ACK and issue STOP byte
	if (Len == 1)
	{
		pI2CxHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_ACK);		// Disable ACK
		I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);		// Generate STOP condition
	} else
	{
		pI2CxHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ACK);		// Enable ACK
	}

	//7. Read the data until Len becomes 0
	//   when the second last byte is in the DR, Disable ACK & issue STOP
	//   so it automatically happens after final byte transfer
	while (Len > 0)
	{
		while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_RXNE)) && (!TIMEDOUT) )	// wait until RXNE is set
		{
			TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
		}
		if ( TIMEDOUT )	return USER_TIMEOUT;

		if (Len == 2)
		{
			pI2CxHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_ACK);	// Disable ACK
			I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);	// Generate STOP condition
		}
		*pRxBuffer = pI2CxHandle->pI2Cx->DR;
		pRxBuffer++;
		Len--;
	}

	//8. Re-enable ACKing if it was enabled in Init
	if (pI2CxHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLED)
	{
		pI2CxHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ACK);
	}

	return I2C_NO_ERROR;
}

/*****************************************************************
 * @fn			- I2C_Mem_MasterSendData
 *
 * @brief		- This function sends data to a slave device's given internal address
 *
 * @param[in]	- pointer to the Handle of the I2C peripheral
 * @param[in]	- pointer to the data to transmit
 * @param[in]	- number of bytes to transmit
 * @param[in]	- address of the slave device
 * @param[in]	- slave devices internal address to write to
 * @param[in]	- maximum time to wait for the I2C operation in milliseconds
 *
 * @return		- I2C error code
 *
 * @Note		-
 */
I2C_ERROR_CODE  I2C_Mem_MasterSendData(I2C_Handle_t *pI2CxHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t SlaveRegister, uint32_t TIMEOUT_MS)
{
	uint32_t TIMEDOUT = 0;
	SYST_STARTorSTOP(ENABLE);

	//1. Generate the START condition
	I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);

	//2. Confirm that start generation is completed by checking the SB flag in the SR1
	//	 Note: Until SB is cleared SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_SB)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//3. Send the address of the slave with R/W bit set to w(0) (total 8 bits)
	I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, SlaveAddr, WRITE);

	//4. Confirm that address phase is completed by checking the ADDR flag in SR1 register
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_ADDR)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//5. Clear the ADDR flag according to its software sequence
	//	 Note: Until ADDR is cleared SCL will be stretched (pulled low)
	I2C_ClearADDRFlag(pI2CxHandle->pI2Cx);

	//6. Send the Slave devices register address to which data shall be written to
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_TXE)) )	// wait until TXE is set
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	pI2CxHandle->pI2Cx->DR = SlaveRegister;

	//7. Send the data until Len becomes 0
	while (Len > 0)
	{
		while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_TXE)) && (!TIMEDOUT) )	// wait until TXE is set
		{
			TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
		}
		if ( TIMEDOUT )	return USER_TIMEOUT;

		pI2CxHandle->pI2Cx->DR = *pTxBuffer;
		pTxBuffer++;
		Len--;
	}

	//8. When Len becomes zero wait for TXE=1 & BTF=1 before generating the STOP condition
	//	 Note: TXE=1, BTF=1, means that both SR and DR are empty and next transmission should begin
	//		  when BTF=1 SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_TXE)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_BTF)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//9. Generate STOP condition and master need not to wait for the completion of STOP condition.
	//   Note: generating STOP, automatically clears the BTF
	I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);

	SYST_STARTorSTOP(DISABLE);

	return I2C_NO_ERROR;
}

/*****************************************************************
 * @fn			- I2C_Mem_MasterReceiveData
 *
 * @brief		- This function reads data from a slave device's given register
 *
 * @param[in]	- pointer to the Handle of the I2C peripheral
 * @param[in]	- pointer to store the read data too
 * @param[in]	- number of bytes to read
 * @param[in]	- address of the slave device
 * @param[in]	- slave devices internal address to read from
 * @param[in]	- maximum time to wait for the I2C operation in milliseconds
 *
 * @return		- I2C error code
 *
 * @Note		-
 */
I2C_ERROR_CODE I2C_Mem_MasterReceiveData(I2C_Handle_t *pI2CxHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t SlaveRegister, uint32_t TIMEOUT_MS)
{
	uint32_t TIMEDOUT = 0;
	SYST_STARTorSTOP(ENABLE);

	// This line somehow makes it work every time?
	//uint32_t temp = ELAPSED_MS();

	//1. Generate the START condition
	I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);

	//2. Confirm that start generation is completed by checking the SB flag in the SR1
	//	 Note: Until SB is cleared SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_SB)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//3. Send the address of the slave with R/W bit set to w(0) (total 8 bits)
	I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, SlaveAddr, WRITE);

	//4. Confirm that address phase is completed by checking the ADDR flag 	while( ! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_ADDR) );
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_ADDR)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//5. Clear the ADDR flag according to its software sequence
	//	 Note: Until ADDR is cleared SCL will be stretched (pulled low)
	I2C_ClearADDRFlag(pI2CxHandle->pI2Cx);

	//6. Send the Slave devices register address to which data shall be written to
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_TXE)) && (!TIMEDOUT) )	// wait until TXE is set
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	pI2CxHandle->pI2Cx->DR = SlaveRegister;

