ArronOC/Portfolio/PetriDish_BareMetal/drivers/Src/stm32f101xx_i2c_driver.c
	//7. Generate the RE-START condition
	I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);

	//8. Confirm that RE-START generation is completed by checking the SB flag in the SR1
	//	 Note: Until SB is cleared SCL will be stretched (pulled low)
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_SB)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//9. Send the address of the slave with R/W bit set to r(1) (total 8 bits)
	I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, SlaveAddr, READ);

	//10. Confirm that address phase is completed by checking the ADDR flag in SR1 register
	while( (! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_ADDR)) && (!TIMEDOUT) )
	{
		TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
	}
	if ( TIMEDOUT )	return USER_TIMEOUT;

	//11. Clear the ADDR flag according to its software sequence
	I2C_ClearADDRFlag(pI2CxHandle->pI2Cx);

	//12. For single byte reception disable ACK and issue STOP byte
	if (Len == 1)
	{
		pI2CxHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_ACK);		// Disable ACK
		I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);		// Generate STOP condition
	} else
	{
		pI2CxHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ACK);		// Enable ACK
	}

	//13. Read the data until Len becomes 0
	//   when the second last byte is in the DR, Disable ACK & issue STOP
	//   so it automatically happens after final byte transfer
	while (Len > 0)
	{
		while( ! I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_FLAG_RXNE) && (!TIMEDOUT) )	// wait until RXNE is set
		{
			TIMEDOUT = (ELAPSED_MS() > TIMEOUT_MS);
		}
		if ( TIMEDOUT )	return USER_TIMEOUT;

		if (Len == 2)
		{
			pI2CxHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_ACK);	// Disable ACK
			I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);	// Generate STOP condition
		}

		*pRxBuffer = pI2CxHandle->pI2Cx->DR;
		pRxBuffer++;
		Len--;
	}

	//14. Re-enable ACKing if it was enabled in Init
	if (pI2CxHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLED)
	{
		pI2CxHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ACK);
	}

	SYST_STARTorSTOP(DISABLE);
	return I2C_NO_ERROR;
}

/*****************************************************************
 * @fn			- I2C_GetFlagStatus
 *
 * @brief		- This function checks if the given flag is set
 *
 * @param[in]	- pointer to the Handle of the I2C peripheral
 * @param[in]	- FLAG to check
 *
 * @return		- whether flag is set or not
 *
 * @Note		- Doesn't check flags in SR2
 */
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName)
{
	if (pI2Cx->SR[0] & FlagName)
	{
		return FLAG_SET;
	} else
	{
		return FLAG_RESET;
	}
}


/*****************************************************************
 * @fn			- I2C_ERR_IRQHandling
 *
 * @brief		-
 *
 * @param[in]	-
 *
 * @return		-
 *
 * @Note		-
 */
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CxHandle)
{

	uint32_t temp1,temp2;

    //Know the status of  ITERREN control bit in the CR2
	temp2 = (pI2CxHandle->pI2Cx->CR2) & ( 1 << I2C_CR2_ITERREN);


/***********************Check for Bus error************************************/
	temp1 = (pI2CxHandle->pI2Cx->SR[0]) & ( 1<< I2C_SR1_BERR);
	if(temp1  && temp2 )
	{
		//This is Bus error

		//Implement the code to clear the bus error flag
		pI2CxHandle->pI2Cx->SR[0] &= ~( 1 << I2C_SR1_BERR);

		//Implement the code to notify the application about the error
	   I2C_ApplicationEventCallback(pI2CxHandle,I2C_BUS_ERROR);
	}

/***********************Check for arbitration lost error************************************/
	temp1 = (pI2CxHandle->pI2Cx->SR[0]) & ( 1 << I2C_SR1_ARLO );
	if(temp1  && temp2)
	{
		//This is arbitration lost error

		//Implement the code to clear the arbitration lost error flag
		pI2CxHandle->pI2Cx->SR[0] &= ~( 1 << I2C_SR1_ARLO);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CxHandle,I2C_ARLO_ERROR);
	}

/***********************Check for ACK failure  error************************************/

	temp1 = (pI2CxHandle->pI2Cx->SR[0]) & ( 1 << I2C_SR1_AF);
	if(temp1  && temp2)
	{
		//This is ACK failure error

	    //Implement the code to clear the ACK failure error flag
		pI2CxHandle->pI2Cx->SR[0] &= ~( 1 << I2C_SR1_AF);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CxHandle,I2C_ACK_ERROR);
	}

/***********************Check for Overrun/underrun error************************************/
	temp1 = (pI2CxHandle->pI2Cx->SR[0]) & ( 1 << I2C_SR1_OVR);
	if(temp1  && temp2)
	{
		//This is Overrun/underrun

	    //Implement the code to clear the Overrun/underrun error flag
		pI2CxHandle->pI2Cx->SR[0] &= ~( 1 << I2C_SR1_OVR);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CxHandle,I2C_ERROR_OVR);
	}

/***********************Check for Time out error************************************/
	temp1 = (pI2CxHandle->pI2Cx->SR[0]) & ( 1 << I2C_SR1_TIMEOUT);
	if(temp1  && temp2)
	{
		//This is Time out error

	    //Implement the code to clear the Time out error flag
		pI2CxHandle->pI2Cx->SR[0] &= ~( 1 << I2C_SR1_TIMEOUT);

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CxHandle,I2C_TIMEOUT_ERROR);
	}
}

///*****************************************************************
// * @fn			- I2C_MasterSendDataIT
// *
// * @brief		-
// *
// * @param[in]	-
// *
// * @return		-
// *
// * @Note		-
// */
//uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CxHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
//{
//
//	uint8_t busystate = pI2CxHandle->TxRxState;
//
//	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
//	{
//		pI2CxHandle->pTxBuffer = pTxBuffer;
//		pI2CxHandle->TxLen = Len;
//		pI2CxHandle->TxRxState = I2C_BUSY_IN_TX;
//		pI2CxHandle->DevAddr = SlaveAddr;
//		pI2CxHandle->Sr = Sr;
//
//		//Implement code to Generate START Condition
//		I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);
//
//		//Implement the code to enable ITBUFEN Control Bit
//		pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);
//
//		//Implement the code to enable ITEVFEN Control Bit
//		pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);
//
//		//Implement the code to enable ITERREN Control Bit
//		pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
//	}
//
//	return busystate;
//}
//
///*****************************************************************
// * @fn			- I2C_MasterReceiveDataIT
// *
// * @brief		-
// *
// * @param[in]	-
// *
// * @return		-
// *
// * @Note		-
// */
//uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CxHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
//{
//	uint8_t busystate = pI2CxHandle->TxRxState;
//
//	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
//	{
//		pI2CxHandle->pRxBuffer = pRxBuffer;
//		pI2CxHandle->RxLen = Len;
//		pI2CxHandle->TxRxState = I2C_BUSY_IN_RX;
//		pI2CxHandle->RxSize = Len; //Rxsize is used in the ISR code to manage the data reception
//		pI2CxHandle->DevAddr = SlaveAddr;
//		pI2CxHandle->Sr = Sr;
//
//		//Implement code to Generate START Condition
//		I2C_GenerateSTARTCondition(pI2CxHandle->pI2Cx);
//
//		//Implement the code to enable ITBUFEN Control Bit
//		pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);
//
//		//Implement the code to enable ITEVFEN Control Bit
//		pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);
//
//		//Implement the code to enable ITERREN Control Bit
//		pI2CxHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
//	}
//
//	return busystate;
//}
//
//
///*****************************************************************
// * @fn			- I2C_EV_IRQHandling
// *
// * @brief		-
// *
// * @param[in]	-
// *
// * @return		-
// *
// * @Note		-
// */
//void I2C_EV_IRQHandling(I2C_Handle_t *pI2CxHandle)
//{
//	//Interrupt handling for both master and slave mode of a device
//	uint32_t ITEVTEN, ITBUFEN, StatusReg;
//
//	ITEVTEN = pI2CxHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITEVTEN);
//	ITBUFEN = pI2CxHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITBUFEN);
//	StatusReg = pI2CxHandle->pI2Cx->SR[0];
//
//	//1. Handle For interrupt generated by SB event
//	//	Note : SB flag is only applicable in Master mode
//	if (ITEVTEN && (StatusReg & I2C_FLAG_SB))
//	{
//		//The interrupt is generated because of SB event
//		//This block will not be executed in slave mode because for slave SB is always zero
//		//In this block the address phase needs to be executed
//		if ( pI2CxHandle->TxRxState == I2C_BUSY_IN_TX )
//		{
//			I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, pI2CxHandle->DevAddr, WRITE);
//		} else if ( pI2CxHandle->TxRxState == I2C_BUSY_IN_RX )
//		{
//			I2C_ExecuteAddressPhase(pI2CxHandle->pI2Cx, pI2CxHandle->DevAddr, READ);
//		}
//
//	}
//
//	//2. Handle For interrupt generated by ADDR event
//	//Note : When master mode : Address is sent
//	//		 When Slave mode  : Address matched with own address
//	if (ITEVTEN && (StatusReg & I2C_FLAG_ADDR))
//	{
//		//Interrupt is generated because of ADDR event
//		I2C_ClearADDRFlag(pI2CxHandle->pI2Cx);
//	}
//
//	//3. Handle For interrupt generated by BTF(Byte Transfer Finished) event
//	if (ITEVTEN && (StatusReg & I2C_FLAG_BTF))
//	{
//		//Interrupt is generated because of BTF event
//		if (pI2CxHandle->TxRxState == I2C_BUSY_IN_TX)
//		{
//			//make sure that TXE is also set.
//			if ( StatusReg & I2C_FLAG_TXE )
//			{
//				//BTF, TXE = 1, close transmission
//				if (pI2CxHandle->TxLen == 0)
//				{
//					//1. Generate the STOP condition if no repeated start.
//					if (pI2CxHandle->Sr == I2C_SR_DISABLE)
//					{
//						I2C_GenerateSTOPCondition(pI2CxHandle->pI2Cx);
//					}
//
//					//2. Reset all member elements of the handle structure.
//					I2C_CloseSendData();
//
//					//3. Notify the application about transmission complete.
//					I2C_ApplicationEventCallback(pI2CxHandle, I2C_EV_TX_CMPLT);
//				}
//
//			}
//
//		} else if (pI2CxHandle->TxRxState == I2C_BUSY_IN_RX)
//		{
//			// Nothing to do
//		}
//
//	}
//
//	//4. Handle For interrupt generated by STOPF event
//	// Note : Stop detection flag is applicable only slave mode . For master this flag will never be set
//	if (ITEVTEN && (StatusReg & I2C_FLAG_STOPF))
//	{
//		//Interrupt is generated because of STOPF event
//		//Clear the STOPF (i.e 1) read SR1 2) Write to CR1 )
//		//reading SR1 is already done to get to this stage
//		pI2CxHandle->pI2Cx->CR1 |= 0x0000;
//
//		//Notify the application that STOP is detected
//		I2C_ApplicationEventCallback(pI2CxHandle, I2C_EV_STOP);
//	}
//
//	//5. Handle For interrupt generated by TXE event
//	if (ITEVTEN && ITBUFEN && (StatusReg & I2C_FLAG_TXE))
//	{
//		//Interrupt is generated because of TXE event
//		//We have to do the data transmission
//		if ( pI2CxHandle->TxRxState == I2C_BUSY_IN_TX )
//		{
//			//Check for device is in Master mode
//			if ( pI2CxHandle->pI2Cx->SR[1] & (1 << I2C_SR2_MSL) )
//			{
//				if ( pI2CxHandle->TxLen > 0 )
//				{
//					//1. Load the data in to DR
//					pI2CxHandle->pI2Cx->DR = *(pI2CxHandle->pTxBuffer);
//
//					//2. Decrement the TxLen
//					pI2CxHandle->TxLen--;
//
//					//3. Increment the buffer address
//					pI2CxHandle->pTxBuffer++;
//				}
//			}
//		}
//	}
//
//	//6. Handle For interrupt generated by RXNE event
//	if (ITEVTEN && ITBUFEN && (StatusReg & I2C_FLAG_RXNE))
//	{
//		//Interrupt is generated because of RXNE event
//		if ( pI2CxHandle->TxRxState == I2C_BUSY_IN_RX )
//		{
//			//We have to do the data reception
//			if ( pI2CxHandle->RxSize == 1 )
//			{
//
//			}
//
//			if ( pI2CxHandle->RxSize > 1 )
//			{
//
//			}
//		}
//	}
//}
